<script setup lang="ts">

const points = [
    'Знакомство и определение запроса. Вы рассказываете то, что считаете нужным, я задаю уточняющие вопросы. Описываю вам свое виденье ситуации и синхронизируемся. Далее я предлагаю вам вектор работы с данной ситуацией.',
    'В случае одноразовой консультации я даю рекомендации, применив которые, вы сможете улучшить ситуацию самостоятельно и домашнее задание для самостоятельного изучения, осмысления.',
    'Для тех, кто готов идти в терапию и менять свою жизнь к лучшему. Мы определим цели терапии. Исследуем ваши чувства, мысли и поведение, с помощью различных методов терапии и возможных домашних заданий, скорректируем необходимое. В процессе будем оценивать результаты и при необходимости корректировать наши действия.'
]
</script>

<template>
  <div id="figureItOutTogether">
    <p class="text-h4 mb-8 main-title">Как мы будем работать</p>
    <!--mdi-heart-outline -->
    <ul>
      <li v-for="(point) in points">
        <p class="text-body-1 ml-2 mb-8">{{ point }}</p>
      </li>
    </ul>
  </div>
</template>

<style scoped lang="sass">
#figureItOutTogether p, ul
  color: #36405a
  font-family: "Montserrat", serif

ul
  display: block
  list-style-type: '♡'
  padding-left: 16px
</style>